In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.metrics import r2_score
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [53]:
data = pd.read_csv('hiring.csv')
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [54]:
for index,value in enumerate(data['experience']):
    if value == 'five':
        data.iloc[index, 0] = 5
    elif value == 'two':
        data.iloc[index, 0] = 2
    elif value == 'seven':
        data.iloc[index, 0] = 7
    elif value == 'three':
        data.iloc[index, 0] = 3
    elif value == 'eleven':
        data.iloc[index, 0] = 11
    elif value == 'ten':
        data.iloc[index, 0] = 10
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2          5                    6.0                           7      60000
3          2                   10.0                          10      65000
4          7                    9.0                           6      70000
5          3                    7.0                          10      62000
6         10                    NaN                           7      72000
7         11                    7.0                           8      80000

In [55]:
data['experience'].fillna(data['experience'].median(), inplace=True)
data['test_score(out of 10)'].fillna(data['test_score(out of 10)'].median(), inplace=True)
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         6.0                    8.0                           9      50000
1         6.0                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000

In [58]:
Y = data['salary($)']
X = data.drop('salary($)', axis=1)
X

   experience  test_score(out of 10)  interview_score(out of 10)
0         6.0                    8.0                           9
1         6.0                    8.0                           6
2         5.0                    6.0                           7
3         2.0                   10.0                          10
4         7.0                    9.0                           6
5         3.0                    7.0                          10
6        10.0                    8.0                           7
7        11.0                    7.0                           8

In [59]:
X_train, X_test, y_train, y_test = train_test_split(X,Y, test_size=0.2,random_state=0)
print(X_train, X_test, y_train, y_test)

   experience  test_score(out of 10)  interview_score(out of 10)
1         6.0                    8.0                           6
7        11.0                    7.0                           8
3         2.0                   10.0                          10
0         6.0                    8.0                           9
5         3.0                    7.0                          10
4         7.0                    9.0                           6    experience  test_score(out of 10)  interview_score(out of 10)
6        10.0                    8.0                           7
2         5.0                    6.0                           7 1    45000
7    80000
3    65000
0    50000
5    62000
4    70000
Name: salary($), dtype: int64 6    72000
2    60000
Name: salary($), dtype: int64

In [61]:
model = LinearRegression()
model.fit(X_train, y_train)
y_pred = model.predict(X_test)
accuracy = r2_score(y_pred,y_test)
accuracy

0.3541822193142461

In [66]:
print(model.intercept_)
print(model.coef_)

-32302.23611445057
[3823.27482568 4463.09208944 4353.20990623]

In [67]:
model.predict([[12,10,10]])

D:\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([101740.08175042])